#+TITLE: Haskell data and Code at Run Time

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

- Representing data and code in memory at run time
- Haskell feature that affect performance
- Code optimizations done by compiler

** 9.1.2 Primitive unboxed data types
Storing everything in closure is not the most efficient thing, to get the better
performance GHC gives us the ability to use /unboxed types/ (sometimes called
/primitive unboxed types/)

~GHC.Prim~ module exports several primitive types
- ~Int#~ signed native-sized integer
- ~Word#~ unsigned native-sized integer
- ~Int8#~, ~Int16#~ smaller size signed integer
- ~Word8#~, ~Word16#~ smaller size unsigned integer
- ~Char#~ 31 bit (???) characters
- ~Float#~ 32 bit floating point number
- ~Double#~ 64 bit floating point number
- ~Addr#~ memory address

NOTE: You need to enable the ~MagicHash~ GHC extension

#+BEGIN_SRC haskell
:set -XMagicHash

:t 3#
:t 3.14#
:t 'x'#
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
3# :: GHC.Prim.Int#
3.14# :: GHC.Prim.Float#
'x'# :: GHC.Prim.Char#
#+END_EXAMPLE

*** Function seq
The function ~seq :: a -> b -> b~ is guaranteed to be strict on the first
argument

#+BEGIN_SRC haskell
:{
sumN :: Int -> Int
sumN = go 0
  where
    go acc 0 = acc
    go acc n = go (acc + n) (n - 1)
:}

sumN 10
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
55
#+END_EXAMPLE

In this implementation ~acc~ will not evaluated until ~n~ is ~0~, with every
call to ~go~ a thunk is created.

#+BEGIN_SRC haskell
:{
sumN :: Int -> Int
sumN = go 0
  where
    go acc 0 = acc
    go acc n = acc `seq` go (acc + n) (n - 1)
:}

sumN 10
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
55
#+END_EXAMPLE

In the last implementation use ~seq~ to keep ~acc~ in its evaluated form.

*** Bang pattern
~BangPatterns~ GHC extension enables adding ~!~ to patterns with the following
effect

#+BEGIN_SRC haskell :eval never
case v of {!pat -> ...; _ -> ...}

-- is equal to

v `seq` case v of {path -> ...; _ -> ...}
#+END_SRC

We can use it in the ~sumN~ function

#+BEGIN_SRC haskell
:set -XBangPatterns

:{
sumN :: Int -> Int
sumN = go 0
  where
    go acc 0 = acc
    go !acc n = go (acc + n) (n - 1)
:}

sumN 10
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
55
#+END_EXAMPLE

NOTE: there's no sense of using ~!~ in destructuring patterns like ~!(x, y)~
since the original pattern ~(x, y)~ is already checking if the value is a pair
therefore evaluating it in its WHNF.

#+BEGIN_SRC haskell
:set -XBangPatterns

-- _ will never be evaluated
let _ = undefined in "OK"

-- let's force it
let !_ = undefined in "OK"
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
> "OK"
> "*** Exception: Prelude.undefined
CallStack (from HasCallStack):
  error, called at libraries/base/GHC/Err.hs:74:14 in base:GHC.Err
  undefined, called at <interactive>:102:10 in interactive:Ghci29
#+END_EXAMPLE

*** Strict folds
Prelude has strict version of the following functions
- ~foldl~ -> ~foldl'~
- ~foldl1~ -> ~foldl1'~
- ~scanl~ -> ~scanl'~
- ~scanl1~ -> ~scanl1'~

#+BEGIN_SRC haskell
import Data.List

:set +s

foldl' (+) 0 [1..10^6]
foldl (+) 0 [1..10^6]

:unset +s
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
500000500000
(0.04 secs, 88,132,336 bytes)
500000500000
(0.24 secs, 161,359,088 bytes)
#+END_EXAMPLE

This makes sense when the evaluation of the accumulator in its WHNF is
equivalent of its NF otherwise is not going to make a difference.

If the accumulator is something like ~data AnotherInt = AI Int~ you need to put
strictness flags in the data constructor.

*** Strictness flags in data constructors
NOTE: when we create some value with a data constructor its arguments are
normally not evaluated, instead a thunk is created for every field.

We can force their evaluation of WHNF by adding a strictness flag to their
definition.

~data AnotherInt = AI !Int~

~data Point = Point {x :: !Double, y :: !Double}~

GHC will apply ~seq~ to the corresponding arguments of the data constructor
before applying it.

#+BEGIN_SRC haskell
data Point = Point {x :: Double, y :: Double} deriving Show

let x = 1.0; y = 2.0 in Point { x = x, y = y }

-- with

data Point = Point {x :: !Double, y :: !Double} deriving Show

-- will become

let x = 1.0; y = 2.0 in x `seq` y `seq` Point {x = x, y = y}
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Point {x = 1.0, y = 2.0}
Point {x = 1.0, y = 2.0}
#+END_EXAMPLE

*** Unboxed tuples and sums
We are not allowed to define primitive unboxed types but we can define unboxed
tuples and unboxed sums using respectively ~UnboxedTuples~ and ~UnboxedSums~
extensions.

#+BEGIN_SRC haskell
:set -XUnboxedTuples
:set -XUnboxedSums

:{
sumProd :: Num a => a -> a -> (# a, a #)
sumProd a b = (# a + b, a * b #)
:}

let (# s, p #) = sumProd 5 6 in print (s, p)

:{
smallest :: (# Double | (# Double, Double #) #) -> Double
smallest (# d | #) = d
smallest (# | (# x, y #) #) = min x y
:}

smallest (# 5.4 | #)
smallest (# | (# 2.3, 1.2 #) #)
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
(11,30)
5.4
1.2
#+END_EXAMPLE

* 9.3 Exploring compiler optimizations by example
NOTE: what's written by the programmer can be different than what's executed by
the GHC runtime

#+BEGIN_SRC haskell
:set +s

:{
isPrime :: Integer -> Bool
isPrime n = all notDividedBy [2..n-1]
  where
    notDividedBy m = n `mod` m /= 0
:}

isPrime 78680101
isPrime 78680100
:unset +s

#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
True
(21.20 secs, 16,995,024,776 bytes)
False
(0.00 secs, 124,880 bytes)
#+END_EXAMPLE

The lazy part did it's job, since the second is divisible by 2 there's no reason
to evaluate other numbers, but we didn't code it, it's in the lazyness (and in
the definition of ~Monoid~ typeclass of ~All~ data type)

